<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px" />

# Exploring NYC Club Complaints with Pandas

_Authors: Julian Oquendo and James Larkin_

### Import standard libraries for data analysis in Python

In [125]:
# Import standard libraries with the commonly used aliases

# Aliased as pd
import pandas as pd

# Numerical Python - library for various mathematical operations
# Aliased as np
import numpy as np

# Seaborn is a robust data visualization library that sits atop Matplotlib
# Aliased as sns 
import seaborn as sns

# pyplot is a Matplotlib module which provides a MATLAB-like interface
# "matplotlib.pyplot" is aliased as plt
import matplotlib.pyplot as plt

### Reading in a comma separated values (csv) file
- [pandas.read_csv](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html)

In [127]:
# Read in the "club_noise_complaints.csv" using a handy Pandas method
# Assign the data to a variable name such as "cc" (for club complaints)

cc = pd.read_csv('data/club_noise_complaints.csv')

cc.info()
# A comma separated values (csv) file is a plain text file that contains a list of data 
# with elements separated by commmas. There are also tab separated files (tsv), json files
# (JavaScript Object Notation), etc.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2447 entries, 0 to 2446
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   index            2447 non-null   int64
 1   LOC              2447 non-null   object
 2   ZC               2447 non-null   int64
 3   CITY             1708 non-null   object
 4   BOUROUGHS_STATE  2447 non-null   object
 5   LAT              2447 non-null   float64
 6   LONG             2447 non-null   float64
 7   num_calls        2447 non-null   object
dtypes: float64(2), int64(2), object(4)
memory usage: 153.1+ KB

### Getting a look at the dataset using Pandas methods such as `.head()`, `.tail()`, and `.sample()`

- [pandas.DataFrame.head](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.head.html)
- [pandas.DataFrame.tail](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.tail.html)
- [pandas.DataFrame.sample](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sample.html)

In [129]:
# Check the first five rows of the Pandas DataFrame
#cc.head(5)

# Check the last five rows of the Pandas DataFrame
#cc.tail(5)
# Check out a sample row of the Pandas DataFrame
cc.sample()

,index,LOC,ZC,CITY,BOUROUGHS_STATE,LAT,LONG,num_calls
915,916,Club/Bar/Restaurant,11206,NaN,"BROOKLYN, NY",40.707003,-73.932448,28

### Output a concise summary of a Pandas DataFrame using `.info()`

- [pandas.DataFrame.info](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.info.html)

In [131]:
# Chain on the `info()` method to the Pandas DataFrame variable
cc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2447 entries, 0 to 2446
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   index            2447 non-null   int64
 1   LOC              2447 non-null   object
 2   ZC               2447 non-null   int64
 3   CITY             1708 non-null   object
 4   BOUROUGHS_STATE  2447 non-null   object
 5   LAT              2447 non-null   float64
 6   LONG             2447 non-null   float64
 7   num_calls        2447 non-null   object
dtypes: float64(2), int64(2), object(4)
memory usage: 153.1+ KB

### Checking the dimensions (number of rows and columns) in the dataset

- [pandas.DataFrame.shape](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.shape.html)

In [133]:
# Chain on the `shape` attribute to the Pandas DataFrame variable
# The output is a tuple containing the number of rows and columns in the DataFrame

cc.shape
# Chain on the `columns` attribute to the Pandas DataFrame variable
# The output is the name of the columns in the Pandas DataFrame

cc.columns

# Chain on the `index` attribute to the Pandas DataFrame variable
# The output is the index of the DataFrame, the data type of that index, and
# the length of number of index values
cc['index']

0          1
1          2
2          3
3          4
4          5
        ...
2442    2443
2443    2444
2444    2445
2445    2446
2446    2447
Name: index, Length: 2447, dtype: int64

In [135]:
cc.columns

Index(['index', 'LOC', 'ZC', 'CITY', 'BOUROUGHS_STATE', 'LAT', 'LONG',
       'num_calls'],
      dtype='object')

### Checking the data types in dataset

- [Pandas DataTypes](https://pbpython.com/pandas_dtypes.html)
![alt text](assets/data_types.png)

In [137]:
# Output the data types in the DataFrame using the `dtypes` attribute
# Common datatypes are int64, float64, object, and many more

cc.dtypes

index                int64
LOC                 object
ZC                   int64
CITY                object
BOUROUGHS_STATE     object
LAT                float64
LONG               float64
num_calls           object
dtype: object

## Check the number of unique values inside either each column/series of a Pandas Dataframe or a single Pandas column/series

- [pandas.DataFrame.nunique](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.nunique.html)
- [pandas.Series.nunique](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.nunique.html)
      - Count the number of distinct observations over a requested axis.

In [139]:
# The `.nunique()` method used on the DataFrame outputs a count of the number of the
# unique values in each column or Pandas Series in the DataFrame

cc.nunique().sort_values()

LOC                   2
BOUROUGHS_STATE       6
CITY                 40
ZC                  159
num_calls           190
LONG               2389
LAT                2390
index              2447
dtype: int64

- [pandas.DataFrame.drop](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html)
      - Drop specified labels from rows or columns.

In [141]:
# From the documentation...
# axis{0 or ‘index’, 1 or ‘columns’}, default 0   <---- this is key
# Whether to drop labels from the index (0 or ‘index’) or columns (1 or ‘columns’).

cc.drop(columns="index", inplace=True)

# So if you want to drop a column, such as the seemingly unneeded "index" column,
# we'll override the default parameter of axis=0 or dropping rows by adding
# axis=1 inside the parantheses

In [143]:
# Check the columns again using the appropriate columns
cc.columns

Index(['LOC', 'ZC', 'CITY', 'BOUROUGHS_STATE', 'LAT', 'LONG', 'num_calls'], dtype='object')

### Checking for missing values 

- [pandas.DataFrame.isnull](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.isnull.html)
      - Detects missing values

In [145]:
# Chaining on the "isnull" method returns a series of Booleans. 
# True if the value is missing (NaN), False if the value is not missing)
# NaN = Not a Number

#cc.isnull()

# Chaining on the .sum() method totals up those 1's and 0's
# True -> 1, False -> 0
cc.isnull().sum()

LOC                  0
ZC                   0
CITY               739
BOUROUGHS_STATE      0
LAT                  0
LONG                 0
num_calls            0
dtype: int64

In [147]:
# Now we can filter that "cc.isnull().sum()" 
cc.isnull().sum()

LOC                  0
ZC                   0
CITY               739
BOUROUGHS_STATE      0
LAT                  0
LONG                 0
num_calls            0
dtype: int64

### Checking for duplicate rows
- [pandas.DataFrame.duplicated](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.duplicated.html)
      - Returns a Series of booleans denoting duplicate rows.
      
      - Key Parameter:
           - keep{‘first’, ‘last’, False}, default ‘first’: Determines which duplicates 
             (if any) to mark.
           - first : Mark duplicates as True except for the first occurrence.
           - last : Mark duplicates as True except for the last occurrence.
           - False : Mark all duplicates as True.

In [149]:
# Here's the boolean output...

cc.duplicated()
# Here's the totals/sums after chaining on the .sum() method

cc.duplicated().sum()

7

In [ ]:
# Always good to check your work...

### Dropping duplicate rows
- [pandas.DataFrame.drop_duplicates](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop_duplicates.html)
      - Returns a DataFrame with duplicate rows removed.

In [151]:
# Use the "drop_duplicates" method and then either assign it back to the DataFrame
# variable name OR explore the inplace parameter and override the default

cc=cc.drop_duplicates()

In [35]:
##cc.drop(columns="index", inplace=True)

In [153]:
cc.columns

Index(['LOC', 'ZC', 'CITY', 'BOUROUGHS_STATE', 'LAT', 'LONG', 'num_calls'], dtype='object')

**Always good to check your work...**

- [pandas.DataFrame.shape](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.shape.html)
      - Returns a tuple representing the dimensionality (rows, columns) of the DataFrame.

In [155]:
# We can use the `shape` attribute again to check the number of rows
# or columns in the DataFrame as we explore the data/make changes to it.
cc.shape

(2440, 7)

### Find the rows where the `num_calls` column contains a `?`

- [pandas.Series.str.contains](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.str.contains.html)
      - Returns a Series of booleans based on whether a given pattern is contained 
        within a string of a Series

In [157]:
# "\" allows us to escape the pattern - the "?" is what we're searching for in the data
cc['num_calls'].str.contains('\\?').sum()
# Use the handy  (length) function to get a count of the rows that contain a "?"

22

In [159]:
cc[cc['num_calls'].str.contains('\\?')]

,LOC,ZC,CITY,BOUROUGHS_STATE,LAT,LONG,num_calls
28,Club/Bar/Restaurant,10009,NEW YORK,"MANHATTAN, NY",40.729531,-73.980416,?
42,Club/Bar/Restaurant,11434,JAMAICA,"QUEENS, NY",40.681879,-73.766080,?
178,Club/Bar/Restaurant,11216,NaN,"BROOKLYN, NY",40.682822,-73.937999,1?
206,Club/Bar/Restaurant,11105,ASTORIA,"QUEENS, NY",40.774785,-73.908777,?
210,Club/Bar/Restaurant,10012,NEW YORK,"MANHATTAN, NY",40.721205,-73.996706,?
220,Club/Bar/Restaurant,11432,JAMAICA,"QUEENS, NY",40.714470,-73.802468,?
244,Club/Bar/Restaurant,11249,NaN,"BROOKLYN, NY",40.721043,-73.956431,?
264,Club/Bar/Restaurant,11211,NaN,"BROOKLYN, NY",40.714951,-73.951753,?
296,Club/Bar/Restaurant,11215,NaN,"BROOKLYN, NY",40.674869,-73.981542,?
320,Club/Bar/Restaurant,11417,OZONE PARK,"QUEENS, NY",40.671816,-73.843092,?
379,Club/Bar/Restaurant,11103,ASTORIA,"QUEENS, NY",40.767238,-73.917419,?
439,Club/Bar/Restaurant,10036,NEW YORK,"MANHATTAN, NY",40.764317,-73.995784,?
567,Club/Bar/Restaurant,11377,WOODSIDE,"QUEENS, NY",40.742023,-73.918941,?
1250,Club/Bar/Restaurant,11249,NaN,"BROOKLYN, NY",40.722244,-73.958894,?
1425,Club/Bar/Restaurant,10009,NEW YORK,"MANHATTAN, NY",40.727267,-73.984497,?
1552,Club/Bar/Restaurant,10009,NEW YORK,"MANHATTAN, NY",40.725173,-73.984191,?
1662,Club/Bar/Restaurant,10040,NEW YORK,"MANHATTAN, NY",40.854907,-73.929644,?
1664,Club/Bar/Restaurant,11419,SOUTH RICHMOND HILL,"QUEENS, NY",40.688159,-73.819190,?
1668,Club/Bar/Restaurant,11238,NaN,"BROOKLYN, NY",40.676891,-73.963605,?
1900,Club/Bar/Restaurant,10453,BRONX,"BRONX, NY",40.858271,-73.902463,1?
1992,Club/Bar/Restaurant,10009,NEW YORK,"MANHATTAN, NY",40.724832,-73.981377,?
2344,Club/Bar/Restaurant,11211,NaN,"BROOKLYN, NY",40.721043,-73.956431,?

### Use a handy method from the NumPy library commonly referred to as `np.where()` to replace the `"?"` and `"1?"` values with a NaN (Not a Number)

- [numpy.where](https://numpy.org/doc/stable/reference/generated/numpy.where.html)
      - Return elements chosen from x or y depending on a condition.
      - Common syntax involves three values:
          1. condition
          2. what to return if condition is True
          3. what to return if condition is False

In [161]:
## cc['num_calls'] = np.where(#condition, #if true, #if false)
cc['num_calls'] = np.where(cc['num_calls'] == '?', 'NaN', cc['num_calls'])
cc['num_calls'] = np.where(cc['num_calls'] == '1?', 'NaN', cc['num_calls'])
cc

,LOC,ZC,CITY,BOUROUGHS_STATE,LAT,LONG,num_calls
0,Club/Bar/Restaurant,10308,STATEN ISLAND,"STATEN ISLAND, NY",40.544096,-74.141155,0
1,Club/Bar/Restaurant,10012,NEW YORK,"MANHATTAN, NY",40.729793,-73.998842,18
2,Club/Bar/Restaurant,10308,STATEN ISLAND,"STATEN ISLAND, NY",40.544209,-74.141040,21
3,Club/Bar/Restaurant,10034,New York,"MANHATTAN, NY",40.866376,-73.928258,160
4,Club/Bar/Restaurant,11220,NaN,"BROOKLYN, NY",40.635207,-74.020285,17
...,...,...,...,...,...,...,...
2442,Club/Bar/Restaurant,11211,NaN,"BROOKLYN, NY",40.711765,-73.942687,16
2443,Club/Bar/Restaurant,11104,SUNNYSIDE,"QUEENS, NY",40.740725,-73.923911,17
2444,Club/Bar/Restaurant,10012,NEW YORK,"MANHATTAN, NY",40.729859,-74.000592,17
2445,Club/Bar/Restaurant,10304,STATEN ISLAND,"STATEN ISLAND, NY",40.628744,-74.079935,11
2446,Club/Bar/Restaurant,11423,HOLLIS,"QUEENS, NY",40.711692,-73.769709,11

In [163]:
len(cc[cc['num_calls'].str.contains('\\?')])

0

In [165]:
cc['num_calls'].str.contains('\\?').sum()

0

In [167]:
cc.describe()

                 ZC          LAT         LONG
count   2440.000000  2440.000000  2440.000000
mean   10631.856967    40.700572   -73.891898
std      591.657847     1.651217     2.994412
min    10001.000000   -40.764281   -74.251277
25%    10019.000000    40.701890   -73.987822
50%    10463.000000    40.728312   -73.957928
75%    11217.000000    40.765226   -73.925376
max    11694.000000    40.910201    73.930575

In [169]:
# Check the missing values in the columns of the Pandas DataFrame
dd=cc['CITY'].isna().sum()
dd
#dd['CITY'] = np.where(dd['CITY'].isnull(), 'New York',dd['CITY'])
#dd

737

### Split the values in `BOUROUGHS_STATE` columns into two separate columns then concat (or add) those two columns to the original Pandas DataFrame

- [pandas.Series.str.split](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.str.split.html)
      - Key Parameters:
        - pat: String or regular expression to split on. If not specified, 
               the method will split on whitespace.
        - expand (default False): Expand the split strings into separate columns.
             - If True, return DataFrame/MultiIndex expanding dimensionality.
             - If False, return Series/Index, containing lists of strings.
                 
- [pandas.concat](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html)
      - Key Parameter: axis {0 = "index", 1 = "columns"}, default 0
         - References the axis to concatenate along.

In [51]:
cc

,LOC,ZC,CITY,BOUROUGHS_STATE,LAT,LONG,num_calls
0,Club/Bar/Restaurant,10308,STATEN ISLAND,"STATEN ISLAND, NY",40.544096,-74.141155,0
1,Club/Bar/Restaurant,10012,NEW YORK,"MANHATTAN, NY",40.729793,-73.998842,18
2,Club/Bar/Restaurant,10308,STATEN ISLAND,"STATEN ISLAND, NY",40.544209,-74.141040,21
3,Club/Bar/Restaurant,10034,New York,"MANHATTAN, NY",40.866376,-73.928258,160
4,Club/Bar/Restaurant,11220,NaN,"BROOKLYN, NY",40.635207,-74.020285,17
...,...,...,...,...,...,...,...
2442,Club/Bar/Restaurant,11211,NaN,"BROOKLYN, NY",40.711765,-73.942687,16
2443,Club/Bar/Restaurant,11104,SUNNYSIDE,"QUEENS, NY",40.740725,-73.923911,17
2444,Club/Bar/Restaurant,10012,NEW YORK,"MANHATTAN, NY",40.729859,-74.000592,17
2445,Club/Bar/Restaurant,10304,STATEN ISLAND,"STATEN ISLAND, NY",40.628744,-74.079935,11
2446,Club/Bar/Restaurant,11423,HOLLIS,"QUEENS, NY",40.711692,-73.769709,11

In [171]:
# Split the 'BOUROUGHS_STATE' column into two separate columns 
# and assign back to the new variable below
# Conceptually similar to using "Text to Columns" in Excel
split= cc['BOUROUGHS_STATE'].str.split(pat=',',n=2,expand=True)

split.columns = ['BOUROUGHS', 'STATE']
split

          BOUROUGHS STATE
0     STATEN ISLAND    NY
1         MANHATTAN    NY
2     STATEN ISLAND    NY
3         MANHATTAN    NY
4          BROOKLYN    NY
...             ...   ...
2442       BROOKLYN    NY
2443         QUEENS    NY
2444      MANHATTAN    NY
2445  STATEN ISLAND    NY
2446         QUEENS    NY

[2440 rows x 2 columns]

In [177]:
# Concat (combine) the new Pandas DataFrame above with the original "cc" DataFrame
##cc = pd.concat([#dataframe1, #dataframe2 ], axis= )
cc = pd.concat([cc,split], axis=0)
cc

,LOC,ZC,CITY,BOUROUGHS_STATE,LAT,LONG,num_calls,BOUROUGHS,STATE
0,Club/Bar/Restaurant,10308.0,STATEN ISLAND,"STATEN ISLAND, NY",40.544096,-74.141155,0,NaN,NaN
1,Club/Bar/Restaurant,10012.0,NEW YORK,"MANHATTAN, NY",40.729793,-73.998842,18,NaN,NaN
2,Club/Bar/Restaurant,10308.0,STATEN ISLAND,"STATEN ISLAND, NY",40.544209,-74.141040,21,NaN,NaN
3,Club/Bar/Restaurant,10034.0,New York,"MANHATTAN, NY",40.866376,-73.928258,160,NaN,NaN
4,Club/Bar/Restaurant,11220.0,NaN,"BROOKLYN, NY",40.635207,-74.020285,17,NaN,NaN
...,...,...,...,...,...,...,...,...,...
2442,NaN,NaN,NaN,NaN,NaN,NaN,NaN,BROOKLYN,NY
2443,NaN,NaN,NaN,NaN,NaN,NaN,NaN,QUEENS,NY
2444,NaN,NaN,NaN,NaN,NaN,NaN,NaN,MANHATTAN,NY
2445,NaN,NaN,NaN,NaN,NaN,NaN,NaN,STATEN ISLAND,NY
2446,NaN,NaN,NaN,NaN,NaN,NaN,NaN,QUEENS,NY

### Drop a column (or columns) from a Pandas DataFrame

- [pandas.DataFrame.drop](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html)
      - Key Parameter: axis{0 --> "index", 1 --> "columns"}, default 0
         - Whether to drop labels from the index (0 or ‘index’) or 
           columns (1 or ‘columns’).

In [179]:
# Drop the original "BOUROUGHS_STATE" column from DataFrame
cc.drop(columns='BOUROUGHS_STATE')

#cc.rename(columns={'0':'BOUROUGHS','1':'STATE'})

#cc.rename(columns={"0":"BOUROUGHS","1":"STATE"})

,LOC,ZC,CITY,LAT,LONG,num_calls,BOUROUGHS,STATE
0,Club/Bar/Restaurant,10308.0,STATEN ISLAND,40.544096,-74.141155,0,NaN,NaN
1,Club/Bar/Restaurant,10012.0,NEW YORK,40.729793,-73.998842,18,NaN,NaN
2,Club/Bar/Restaurant,10308.0,STATEN ISLAND,40.544209,-74.141040,21,NaN,NaN
3,Club/Bar/Restaurant,10034.0,New York,40.866376,-73.928258,160,NaN,NaN
4,Club/Bar/Restaurant,11220.0,NaN,40.635207,-74.020285,17,NaN,NaN
...,...,...,...,...,...,...,...,...
2442,NaN,NaN,NaN,NaN,NaN,NaN,BROOKLYN,NY
2443,NaN,NaN,NaN,NaN,NaN,NaN,QUEENS,NY
2444,NaN,NaN,NaN,NaN,NaN,NaN,MANHATTAN,NY
2445,NaN,NaN,NaN,NaN,NaN,NaN,STATEN ISLAND,NY
2446,NaN,NaN,NaN,NaN,NaN,NaN,QUEENS,NY

In [189]:
# Check your work
cc

,LOC,ZC,CITY,BOUROUGHS_STATE,LAT,LONG,num_calls,BOUROUGHS,STATE
0,Club/Bar/Restaurant,10308.0,STATEN ISLAND,"STATEN ISLAND, NY",40.544096,-74.141155,0,NaN,NaN
1,Club/Bar/Restaurant,10012.0,NEW YORK,"MANHATTAN, NY",40.729793,-73.998842,18,NaN,NaN
2,Club/Bar/Restaurant,10308.0,STATEN ISLAND,"STATEN ISLAND, NY",40.544209,-74.141040,21,NaN,NaN
3,Club/Bar/Restaurant,10034.0,New York,"MANHATTAN, NY",40.866376,-73.928258,160,NaN,NaN
4,Club/Bar/Restaurant,11220.0,NaN,"BROOKLYN, NY",40.635207,-74.020285,17,NaN,NaN
...,...,...,...,...,...,...,...,...,...
2442,NaN,NaN,NaN,NaN,NaN,NaN,NaN,BROOKLYN,NY
2443,NaN,NaN,NaN,NaN,NaN,NaN,NaN,QUEENS,NY
2444,NaN,NaN,NaN,NaN,NaN,NaN,NaN,MANHATTAN,NY
2445,NaN,NaN,NaN,NaN,NaN,NaN,NaN,STATEN ISLAND,NY
2446,NaN,NaN,NaN,NaN,NaN,NaN,NaN,QUEENS,NY

# cc = cc.rename(columns={0:"BOUROUGHS",1:"STATE"})
cc

### Rename columns in a Pandas DataFrame

- [pandas.DataFrame.rename](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html)
      - Accepts a dictionary of key/values pairs to rename columns in a Pandas DataFrame
      - Key Parameter: columns

In [ ]:
# Pass a dictionary of key:values pairs to the columns parameter of the "rename" method
#cc.rename(# enter code here...
    
cc.rename(columns={"0":"BOUROUGHS","1":"STATE"})

In [ ]:
# Check your work

### Reorder columns in a Pandas DataFrame

- [pandas.DataFrame.reindex](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.reindex.html)
      - Can be used to reorder columns in a Pandas DataFrame
      - Key Parameter: columns

In [187]:
# Pass a list of column names (as string) to the columns parameter of the "reindex" method

#df.reindex(['http_status', 'user_agent'], axis="columns")
cc.reindex(['CITY'], axis="columns")

               CITY
0     STATEN ISLAND
1          NEW YORK
2     STATEN ISLAND
3          New York
4               NaN
...             ...
2442            NaN
2443            NaN
2444            NaN
2445            NaN
2446            NaN

[7320 rows x 1 columns]

In [ ]:
# Check your work

### Use `.describe()` to output descriptive statistic for the numeric columns in the Pandas DataFrame

- [pandas.DataFrame.describe](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.describe.html)
      - Descriptive statistics summarizing the central tendency, dispersion and 
        shape of a dataset’s distribution, excluding NaN values.

In [209]:
# The `describe()` method outputs descriptive statistics by default for the
# numeric columns in the Pandas DataFrame.
cc.describe()

                 ZC          LAT         LONG
count   2440.000000  2440.000000  2440.000000
mean   10631.856967    40.700572   -73.891898
std      591.657847     1.651217     2.994412
min    10001.000000   -40.764281   -74.251277
25%    10019.000000    40.701890   -73.987822
50%    10463.000000    40.728312   -73.957928
75%    11217.000000    40.765226   -73.925376
max    11694.000000    40.910201    73.930575

In [205]:
# Setting a condition outputs a series of Booleans. 
# True if the condition is met, False if not
condition = cc['num_calls']>= '0'
condition

0        True
1        True
2        True
3        True
4        True
        ...
2442    False
2443    False
2444    False
2445    False
2446    False
Name: num_calls, Length: 7320, dtype: bool

In [221]:
# Filtering the "cc" DataFrame by the condition of "cc['latitude'] <= 0"
# will return the rows where that condition is met 
# (latitude values is less than or equal to zero)
condition = cc['LAT'] <= 0
condition

0       False
1       False
2       False
3       False
4       False
        ...
2442    False
2443    False
2444    False
2445    False
2446    False
Name: LAT, Length: 7320, dtype: bool

In [225]:
# Now just flipping the sign around for the "longitude" Series (column) to output
# the rows where the longitude value is greater than or equal to zero
condition = cc['LONG'] >= 0
condition

0       False
1       False
2       False
3       False
4       False
        ...
2442    False
2443    False
2444    False
2445    False
2446    False
Name: LONG, Length: 7320, dtype: bool

**`.loc` and `.iloc`**
  - [Indexing and selecting data](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html)
  - [Handy .loc and .iloc resource](https://www.shanelynn.ie/select-pandas-dataframe-rows-and-columns-using-iloc-loc-and-ix/)

In [235]:
# Fix the erroneous value in the "longitude" column
print(cc['LONG'].dtype)
cc['LONG'] = pd.to_numeric(cc['LONG'], errors='coerce').fillna(0.0)
cc

float64

,LOC,ZC,CITY,BOUROUGHS_STATE,LAT,LONG,num_calls,BOUROUGHS,STATE
0,Club/Bar/Restaurant,10308.0,STATEN ISLAND,"STATEN ISLAND, NY",40.544096,-74.141155,0,NaN,NaN
1,Club/Bar/Restaurant,10012.0,NEW YORK,"MANHATTAN, NY",40.729793,-73.998842,18,NaN,NaN
2,Club/Bar/Restaurant,10308.0,STATEN ISLAND,"STATEN ISLAND, NY",40.544209,-74.141040,21,NaN,NaN
3,Club/Bar/Restaurant,10034.0,New York,"MANHATTAN, NY",40.866376,-73.928258,160,NaN,NaN
4,Club/Bar/Restaurant,11220.0,NaN,"BROOKLYN, NY",40.635207,-74.020285,17,NaN,NaN
...,...,...,...,...,...,...,...,...,...
2442,NaN,NaN,NaN,NaN,NaN,0.000000,NaN,BROOKLYN,NY
2443,NaN,NaN,NaN,NaN,NaN,0.000000,NaN,QUEENS,NY
2444,NaN,NaN,NaN,NaN,NaN,0.000000,NaN,MANHATTAN,NY
2445,NaN,NaN,NaN,NaN,NaN,0.000000,NaN,STATEN ISLAND,NY
2446,NaN,NaN,NaN,NaN,NaN,0.000000,NaN,QUEENS,NY

In [239]:
# Fix the erroneous value in the "latitude" column
print(cc['LAT'].dtype)
cc['LAT'] = pd.to_numeric(cc['LONG'], errors='coerce').fillna(0.0)
cc

float64

,LOC,ZC,CITY,BOUROUGHS_STATE,LAT,LONG,num_calls,BOUROUGHS,STATE
0,Club/Bar/Restaurant,10308.0,STATEN ISLAND,"STATEN ISLAND, NY",-74.141155,-74.141155,0,NaN,NaN
1,Club/Bar/Restaurant,10012.0,NEW YORK,"MANHATTAN, NY",-73.998842,-73.998842,18,NaN,NaN
2,Club/Bar/Restaurant,10308.0,STATEN ISLAND,"STATEN ISLAND, NY",-74.141040,-74.141040,21,NaN,NaN
3,Club/Bar/Restaurant,10034.0,New York,"MANHATTAN, NY",-73.928258,-73.928258,160,NaN,NaN
4,Club/Bar/Restaurant,11220.0,NaN,"BROOKLYN, NY",-74.020285,-74.020285,17,NaN,NaN
...,...,...,...,...,...,...,...,...,...
2442,NaN,NaN,NaN,NaN,0.000000,0.000000,NaN,BROOKLYN,NY
2443,NaN,NaN,NaN,NaN,0.000000,0.000000,NaN,QUEENS,NY
2444,NaN,NaN,NaN,NaN,0.000000,0.000000,NaN,MANHATTAN,NY
2445,NaN,NaN,NaN,NaN,0.000000,0.000000,NaN,STATEN ISLAND,NY
2446,NaN,NaN,NaN,NaN,0.000000,0.000000,NaN,QUEENS,NY

**Always good to check your work...**

In [247]:
# Check the "longitude" column again for any erroneous values
cc['LONG'].unique()

array([-74.14115469, -73.99884181, -74.14103979, ..., -74.07993453,
       -73.76970902,   0.        ])

In [249]:
cc['LONG'].dtype

dtype('float64')

In [257]:
# Check the "latitude" column again for any erroneous values
cc['LAT'].unique()

array([-74.14115469, -73.99884181, -74.14103979, ..., -74.07993453,
       -73.76970902,   0.        ])

### We can write all this work back to a csv file if we wish to. 

- [pandas.DataFrame.to_csv](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html)
      - Key Parameter: index (bool), default True
         - Write row names (index)

In [261]:
# Write the cleaned up Pandas DataFrame to a comma-separated values (csv) file.
cc.to_csv('cleaned_data.csv', index=False)
cc

,LOC,ZC,CITY,BOUROUGHS_STATE,LAT,LONG,num_calls,BOUROUGHS,STATE
0,Club/Bar/Restaurant,10308.0,STATEN ISLAND,"STATEN ISLAND, NY",-74.141155,-74.141155,0,NaN,NaN
1,Club/Bar/Restaurant,10012.0,NEW YORK,"MANHATTAN, NY",-73.998842,-73.998842,18,NaN,NaN
2,Club/Bar/Restaurant,10308.0,STATEN ISLAND,"STATEN ISLAND, NY",-74.141040,-74.141040,21,NaN,NaN
3,Club/Bar/Restaurant,10034.0,New York,"MANHATTAN, NY",-73.928258,-73.928258,160,NaN,NaN
4,Club/Bar/Restaurant,11220.0,NaN,"BROOKLYN, NY",-74.020285,-74.020285,17,NaN,NaN
...,...,...,...,...,...,...,...,...,...
2442,NaN,NaN,NaN,NaN,0.000000,0.000000,NaN,BROOKLYN,NY
2443,NaN,NaN,NaN,NaN,0.000000,0.000000,NaN,QUEENS,NY
2444,NaN,NaN,NaN,NaN,0.000000,0.000000,NaN,MANHATTAN,NY
2445,NaN,NaN,NaN,NaN,0.000000,0.000000,NaN,STATEN ISLAND,NY
2446,NaN,NaN,NaN,NaN,0.000000,0.000000,NaN,QUEENS,NY